; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 10922)
	(= (fuel plane1) 1168)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at person1 city1)
	(at person2 city0)
	(at person3 city1)
	(at person4 city3)
	(at person5 city1)
	(at person6 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 577)
	(= (distance city0 city2) 655)
	(= (distance city0 city3) 674)
	(= (distance city1 city0) 577)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 646)
	(= (distance city1 city3) 620)
	(= (distance city2 city0) 655)
	(= (distance city2 city1) 646)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 694)
	(= (distance city3 city0) 674)
	(= (distance city3 city1) 620)
	(= (distance city3 city2) 694)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at person1 city2)
	(at person2 city0)
	(at person3 city0)
	(at person4 city1)
	(at person6 city2)
	))

(:metric minimize (+ (* 5 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane1 city2)
   changed: (fuel plane1) from 1168 to 10922
   goals met: 2 of 6
2. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 2584, (fuel plane1) from 10922 to 8338
   goals met: 3 of 6
3. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 6
4. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 6
5. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 2584 to 5168, (fuel plane1) from 8338 to 5754
   goals met: 2 of 6
6. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 3 of 6
7. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 5168 to 7788, (fuel plane1) from 5754 to 3134
   goals met: 3 of 6
8. (debark person3 plane1 city0)
   deleted: (in person3 plane1)
   added: (at person3 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 6
9. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 7788 to 10096, (fuel plane1) from 3134 to 826
   goals met: 5 of 6
10. (refuel plane1 city1)
   changed: (fuel plane1) from 826 to 10922
   goals met: 5 of 6
11. (zoom plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 10096 to 18156, (fuel plane1) from 10922 to 2862
   goals met: 4 of 6
12. (board person4 plane1 city3)
   deleted: (at person4 city3)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 6
13. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 18156 to 20636, (fuel plane1) from 2862 to 382
   goals met: 5 of 6
14. (debark person4 plane1 city1)
   deleted: (in person4 plane1)
   added: (at person4 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 6
